cmsis-svd/cmsis-svd/data/NordicSemi/nrf5340_net.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UICR_NS</name>
      <description>User Information Configuration Registers</description>
      <baseAddress>0x01FF8000</baseAddress>
      <headerStructName>UICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>UICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>APPROTECT</name>
          <description>Access port protection</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PALL</name>
              <description>Blocks debugger read/write access to all CPU registers and memory mapped
        addresses Any value except for the enumerations will yield unexpected results.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unprotected</name>
                  <description>Unprotected</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Protected</name>
                  <description>Protected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPROTECT</name>
          <description>Erase protection</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PALL</name>
              <description>Blocks NVMC ERASEALL and CTRLAP ERASEALL functionality. Any value except for the enumerations will yield unexpected results.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unprotected</name>
                  <description>Unprotected</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Protected</name>
                  <description>Protected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>NRFFW[%s]</name>
          <description>Description collection: Reserved for Nordic firmware design</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>NRFFW</name>
              <description>Reserved for Nordic firmware design</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CUSTOMER[%s]</name>
          <description>Description collection: Reserved for customer</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CUSTOMER</name>
              <description>Reserved for customer</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CTI_NS</name>
      <description>Cross-Trigger Interface control. NOTE: this is not a separate peripheral, but describes CM33 functionality.</description>
      <baseAddress>0xE0042000</baseAddress>
      <headerStructName>CTI</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CTI</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CTICONTROL</name>
          <description>CTI Control register</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GLBEN</name>
              <description>Enables or disables the CTI</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>All cross-triggering mapping logic functionality is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Cross-triggering mapping logic functionality is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIINTACK</name>
          <description>CTI Interrupt Acknowledge register</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DEBUGREQ</name>
              <description>Processor debug request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPURESTART</name>
              <description>Processor Restart</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNUSED0</name>
              <description>N/A</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNUSED1</name>
              <description>N/A</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNUSED2</name>
              <description>N/A</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNUSED3</name>
              <description>N/A</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNUSED4</name>
              <description>N/A</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNUSED5</name>
              <description>N/A</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Acknowledge</name>
                  <description>Clears the ctitrigout</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIAPPSET</name>
          <description>CTI Application Trigger Set register</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>APPSET_0</name>
              <description>Application trigger event for channel 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Application trigger 0 is inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Application trigger 0 is active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Activate</name>
                  <description>Generate channel event for channel 0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPSET_1</name>
              <description>Application trigger event for channel 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Application trigger 1 is inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Application trigger 1 is active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Activate</name>
                  <description>Generate channel event for channel 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPSET_2</name>
              <description>Application trigger event for channel 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Application trigger 2 is inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Application trigger 2 is active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Activate</name>
                  <description>Generate channel event for channel 2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPSET_3</name>
              <description>Application trigger event for channel 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Application trigger 3 is inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Application trigger 3 is active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Activate</name>
                  <description>Generate channel event for channel 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIAPPCLEAR</name>
          <description>CTI Application Trigger Clear register</description>
          <addressOffset>0x018</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>APPCLEAR_0</name>
              <description>Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the event for channel 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPCLEAR_1</name>
              <description>Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the event for channel 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPCLEAR_2</name>
              <description>Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the event for channel 2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPCLEAR_3</name>
              <description>Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the event for channel 3</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIAPPPULSE</name>
          <description>CTI Application Pulse register</description>
          <addressOffset>0x01C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>APPULSE_0</name>
              <description>Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the register for each channel.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Generate</name>
                  <description>Generates an event pulse on channel 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPULSE_1</name>
              <description>Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the register for each channel.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Generate</name>
                  <description>Generates an event pulse on channel 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPULSE_2</name>
              <description>Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the register for each channel.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Generate</name>
                  <description>Generates an event pulse on channel 2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPULSE_3</name>
              <description>Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the register for each channel.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Generate</name>
                  <description>Generates an event pulse on channel 3</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
