cmsis-svd/cmsis-svd/data/NordicSemi/nrf5340_net.svd
        <register>
          <name>HFCLKALWAYSRUN</name>
          <description>Automatic or manual control of HFCLK128M/HFCLK64M</description>
          <addressOffset>0x570</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ALWAYSRUN</name>
              <description>Ensure clock is always running</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Automatic</name>
                  <description>Use automatic clock control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AlwaysRun</name>
                  <description>Ensure clock is always running</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFCLKALWAYSRUN</name>
          <description>Automatic or manual control of LFCLK</description>
          <addressOffset>0x574</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ALWAYSRUN</name>
              <description>Ensure clock is always running</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Automatic</name>
                  <description>Use automatic clock control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AlwaysRun</name>
                  <description>Ensure clock is always running</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFCLKAUDIOALWAYSRUN</name>
          <description>Automatic or manual control of HFCLKAUDIO</description>
          <addressOffset>0x57C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ALWAYSRUN</name>
              <description>Ensure clock is always running</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Automatic</name>
                  <description>Use automatic clock control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AlwaysRun</name>
                  <description>Ensure clock is always running</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFCLK192MSRC</name>
          <description>Clock source for HFCLK192M</description>
          <addressOffset>0x580</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <description>Select which HFCLK192M source is started by the HFCLK192MSTART task</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFINT</name>
                  <description>HFCLK192MSTART task starts HFINT oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFCLK192MSTART task starts HFXO oscillator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFCLK192MALWAYSRUN</name>
          <description>Automatic or manual control of HFCLK192M</description>
          <addressOffset>0x584</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ALWAYSRUN</name>
              <description>Ensure clock is always running</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Automatic</name>
                  <description>Use automatic clock control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AlwaysRun</name>
                  <description>Ensure clock is always running</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFCLK192MCTRL</name>
          <description>HFCLK192M frequency configuration</description>
          <addressOffset>0x5B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>HCLK192M</name>
              <description>High frequency clock HCLK192M</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Div1</name>
                  <description>Divide HFCLK192M by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>Divide HFCLK192M by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>Divide HFCLK192M by 4</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
