cmsis-svd/cmsis-svd/data/NordicSemi/nrf5340_net.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CTRLAP_NS</name>
      <description>Control access port</description>
      <baseAddress>0x41006000</baseAddress>
      <headerStructName>CTRLAPPERI</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CTRLAPPERI</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>MAILBOX</name>
          <description>Unspecified</description>
          <headerStructName>CTRLAPPERI_MAILBOX</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>RXDATA</name>
            <description>Data sent from the debugger to the CPU</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RXDATA</name>
                <description>Data received from debugger</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXSTATUS</name>
            <description>Status to indicate if data sent from the debugger to the CPU has been read</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RXSTATUS</name>
                <description>Status of data in register RXDATA</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoDataPending</name>
                    <description>No data pending in register RXDATA</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DataPending</name>
                    <description>Data pending in register RXDATA</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TXDATA</name>
            <description>Data sent from the CPU to the debugger</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TXDATA</name>
                <description>Data sent to debugger</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSTATUS</name>
            <description>Status to indicate if data sent from the CPU to the debugger has been read</description>
            <addressOffset>0x84</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TXSTATUS</name>
                <description>Status of data in register TXDATA</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoDataPending</name>
                    <description>No data pending in register TXDATA</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DataPending</name>
                    <description>Data pending in register TXDATA</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>ERASEPROTECT</name>
          <description>Unspecified</description>
          <headerStructName>CTRLAPPERI_ERASEPROTECT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>LOCK</name>
            <description>Lock register ERASEPROTECT.DISABLE from being written until next reset</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LOCK</name>
                <description>Lock register ERASEPROTECT.DISABLE from being written until next reset</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>Register ERASEPROTECT.DISABLE is writeable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>Register ERASEPROTECT.DISABLE is read-only</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DISABLE</name>
            <description>Disable ERASEPROTECT and perform ERASEALL</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY</name>
                <description>The ERASEALL sequence will be initiated if value of KEY fields are non-zero and KEY fields match on both CPU and debugger side</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>APPROTECT</name>
          <description>Unspecified</description>
          <headerStructName>CTRLAPPERI_APPROTECT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x540</addressOffset>
          <register>
            <name>LOCK</name>
            <description>Lock register APPROTECT.DISABLE from being written to until next reset</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LOCK</name>
                <description>Lock register APPROTECT.DISABLE from being written to until next reset</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>Register APPROTECT.DISABLE is writeable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>Register APPROTECT.DISABLE is read-only</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DISABLE</name>
            <description>Disable APPROTECT and enable debug access to non-secure mode</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY</name>
                <description>Disable APPROTECT and enable debug access to non-secure mode until next pin reset if KEY fields match The current APPROTECT value as configured from UICR is bypassed if value of KEY fields are non-zero and KEY fields match on both CPU and debugger side</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>SECUREAPPROTECT</name>
          <description>Unspecified</description>
          <headerStructName>CTRLAPPERI_SECUREAPPROTECT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x548</addressOffset>
          <register>
            <name>LOCK</name>
            <description>Lock register SECUREAPPROTECT.DISABLE from being written until next reset</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LOCK</name>
                <description>Lock register SECUREAPPROTECT.DISABLE from being written until next reset</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>Register SECUREAPPROTECT.DISABLE is writeable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>Register SECUREAPPROTECT.DISABLE is read-only</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DISABLE</name>
            <description>Disable SECUREAPPROTECT and enable debug access to secure mode</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY</name>
                <description>Disable SECUREAPPROTECT and enable debug of secure mode until next pin reset if KEY fields match The current SECUREAPPROTECT value as configured from UICR is bypassed if value of KEY fields are non-zero and KEY fields match on both CPU and debugger side</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>STATUS</name>
          <description>Status bits for CTRL-AP peripheral</description>
          <addressOffset>0x600</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBGIFACEMODE</name>
              <description>Status bit for device debug interface mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No debugger attached</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debugger is attached and device is in debug interface mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APPROTECT</name>
              <description>Status bit for access port protection in non-secure mode</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Non-secure mode access port protection is currently disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Non-secure mode access port protection is currently enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECUREAPPROTECT</name>
              <description>Status bit for access port protection in secure mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Secure mode access port protection is currently disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Secure mode access port protection is currently enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
